<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class NeighborhoodSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $data = [
            'منطقه ۱' => ['تجریش', 'زعفرانیه', 'الهیه', 'فرمانیه', 'نیاوران', 'کامرانیه', 'دزاشیب', 'قیطریه', 'چیذر', 'اوین', 'دربند', 'ازگل', 'رستم‌آباد'],
            'منطقه ۲' => ['سعادت‌آباد', 'شهرک قدس', 'پونک', 'فرحزاد', 'مرزداران'],
            'منطقه ۳' => ['ونک', 'جردن', 'اختیاریه', 'قلهک', 'داوودیه', 'پاسداران', 'دارآباد', 'صاحبقرانیه', 'نارمک'],
            'منطقه ۴' => ['نارمک', 'تهرانپارس', 'حکیمیه', 'شمیران‌نو', 'مجیدیه', 'لویزان', 'شمس‌آباد', 'گلشن'],
            'منطقه ۵' => ['شهرآرا', 'باغ فیض', 'پونک', 'کن', 'صادقیه', 'ابوذر', 'فردوس', 'شهر زیبا', 'آریاشهر', 'جنت‌آباد' , 'شهران'],
            'منطقه ۶' => ['امیرآباد', 'کارگر', 'پارک لاله', 'خیابان ولیعصر', 'خیابان انقلاب', 'بهار', 'فاطمی', 'دانشگاه تهران'],
            'منطقه ۷' => ['عباس‌آباد', 'نظام‌آباد', 'گلرگ', 'شریعتی', 'بهجت‌آباد'],
            'منطقه ۸' => ['نارمک', 'کرمان', 'فدک', 'معلم', 'مبارک‌آباد', 'هاشم‌آباد'],
            'منطقه ۹' => ['مهرآباد', 'تهرانسر', 'استخر', 'شمشیری', 'سرآسیاب'],
            'منطقه ۱۰' => ['جیحون', 'بریانک', 'شادمان', 'هاشمی', 'حشمتیه'],
            'منطقه ۱۱' => ['نازی‌آباد', 'یوسف‌آباد', 'خیابان جمهوری', 'شیخ هادی', 'مطهری', 'توحید'],
            'منطقه ۱۲' => ['بازار تهران', 'پامنار', 'سنگلج', 'دروازه ری', 'مولوی', 'میدان محمدیه', 'گارسی'],
            'منطقه ۱۳' => ['راه‌آهن', 'نبرد', 'مجاهدین اسلام', 'دهم فروردین'],
            'منطقه ۱۴' => ['کیانشهر', 'مسعودیه', 'خیابان خاوران', 'سرخه حصار', 'نظام‌آباد'],
            'منطقه ۱۵' => ['دولاب', 'شاهد', 'افسریه', 'مسعودیه', 'هاشم‌آباد'],
            'منطقه ۱۶' => ['خانی‌آباد', 'شهرک بعثت', 'جوادیه', 'نعمت‌آباد', 'علی‌آباد جنوبی'],
            'منطقه ۱۷' => ['یافت‌آباد', 'اسکندری', 'برلیان', 'نعمت‌آباد'],
            'منطقه ۱۸' => ['خلیج فارس', 'آذری', 'فتح', 'شادآباد', 'یافت‌آباد'],
            'منطقه ۱۹' => ['شهر ری', 'خانی‌آباد نو', 'شوش', 'نخلستان', 'مسلم بن عقیل'],
            'منطقه ۲۰' => ['شهر ری', 'حرم عبدالعظیم', 'دولت‌آباد', 'قیام‌دشت'],
            'منطقه ۲۱' => ['تهرانسر', 'وردآورد', 'دهکده المپیک'],
            'منطقه ۲۲' => ['دریاچه چیتگر', 'شهرک پایداری', 'منظریه', 'شهرک گلستان', 'کوهسار']
        ];

        foreach ($data as $regionName => $neighborhoods) {
            // ابتدا منطقه را می‌سازیم
            $region = \App\Models\Neighborhood::create(['name' => $regionName, 'parent_id' => null]);
            
            // سپس محله‌های آن منطقه را وصل می‌کنیم به آن
            foreach ($neighborhoods as $name) {
                \App\Models\Neighborhood::create([
                    'name' => $name,
                    'parent_id' => $region->id
                ]);
            }
        }
    }

}
